---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailExtensionLengthParam
source: html/a89c954f-4d31-2265-5f96-e930fe52c9e0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailExtensionLengthParam Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailExtensionLengthParam { get; }
```